[{"html": "<p>Above are autocorrelograms, or a lines plotting the values of of autocorrelations at different lags. Autocorrelations serve as a measure of how well demand at a given time can predict demand at a given lag in the future . The closer an its absolute value is to 1, the better it is as a predictor. (A number close to -1 means high demand accurately predicts low demand, or low demand accurately predicts high demand, at a given lag.)</p><p>Also displayed is the approximate confidence interval for these autocorrelations. Each autocorrelation is of hourly demand, so over 21 whole weeks 3528 hours were examined. The 95% confidence interval is therefore approximately within 1.96 / sqrt(3528), a scant 0.034.</p><p>Click on the lines or tabs for an explanation of each autocorrelogram.</p>", "interval": [-0.03299831645537222, 0.03299831645537222], "values": [], "name": "overallExplanation", "full_name": "Intro"}, {"html": "<p>Above are autocorrelations of counts at multiples of 168 hours, or weeks. For a lag of one, the count of weekly demand during the 11 pm hour on Saturday night is correlated with that of the 11 pm hour on the previous Saturday night. For a lag of two, it is correlated with the proportion of weekly demand of the 11 pm hour two Saturdays prior, etc...</p><p><em>This autocorrelation stays quite high, degrading slowly over time. As we will see in the autocorrelelogram for weekly proportion, this degradation is more of an indicator of fluctuation in the growth of total demand than in the how this demand is distributed within a week.</em></p>", "interval": [], "values": [0.7074270696292816, 0.6883493442605307, 0.663937876765695, 0.6470748641902963, 0.650477245600217, 0.6443432918087119, 0.6552132396895423, 0.6157193795427383, 0.65310646730651, 0.5463759248380321], "name": "weeklyCount", "full_name": "Weekly Count"}, {"html": "<p>Above are autocorrelations of proportions at multiples of 168 hours, or weeks. For a lag of one, the count of weekly demand during the 11 pm hour on Saturday night is correlated with that of the 11 pm hour on the previous Saturday night. For a lag of two, it is correlated with the proportion of weekly demand of the 11 pm hour two Saturdays prior, etc...</p><p><em>This autocorrelation also stays quite high, and does not degrade over time. While the growth (or decrease) in weekly demand fluctuates over time, how this demand fluctuates within a week is remarkably stable.</em></p>", "interval": [], "values": [0.7250740670477608, 0.7209077999214403, 0.7254071217281562, 0.7188493389699069, 0.7235220061275314, 0.7148904723451124, 0.7151064181428712, 0.6987121790486972, 0.7289376198091002, 0.7197303797958011], "name": "weeklyProportion", "full_name": "Weekly Proportion"}, {"html": "<p>Above are autocorrelations of deviations from mean proportions at multiples of 168 hours, or weeks. This serves as a measure for if an above- or below-average serves as a good predictor for demand in subsequent weeks.</p><p>Let us say that, for the 21 whole weeks observed, the mean proportion of weekly demand during the 11 pm hour is 2.00%. If, on the Saturday of a given week, the 11 pm hour makes up 2.15% of weekly demand, the 11 pm hour one week prior makes up 1.75%, and the 11 pm hour two weeks prior makes up 2.05%. The corresponding deviations would be +0.15%, -0.25%, and +0.05%. For a lag of one, the +0.15% deviation is correlated with -0.25%. For a lag of two, it is correlated with +0.05%, etc...</p><p><em>While significantly negative, the values in this autocorrelogram are so close to zero that they can be ignored. In a large enough sample, tiny correlations can be significant, and this is one such case. If they were higher, a SARIMA could be used to capture this correlation.</em></p>", "interval": [], "values": [-0.04921334777851885, -0.08012517819643956, -0.0523727763939112, -0.03780834849254049, -0.013134828449869546, 0.0012795669882126716, -0.0047716895341582246, -0.1005257672868004, -0.06793494359198225, -0.076521993539647], "name": "weeklyDeviation", "full_name": "Weekly Deviation"}, {"html": "<p>Above are autocorrelations of deviations from mean proportions at multiples of hours. This serves as a measure for if an above- or below-average serves as a good predictor for demand in the immediate future.</p><p>Let us say that, for the 21 whole weeks observed, the mean proportion of weekly demand during the 9 pm our is 1.25%, during the 10 pm hour is 1.50%, and during the 11 pm hour is 2.00%. If, on the Saturday of a given week, the 9 pm hour makes up 1.15% of weekly demand, the 10 pm hour makes up 1.70%, and the 11 pm hour makes up 2.15%. The corresponding deviations would be -0.10%, +0.20%, and +0.15%. For a lag of one, the +0.15% deviation is correlated with +0.20%. For a lag of two, it is correlated -0.10%, etc...</p><p><em>The values are nicely significant and degrade slowly over time. Still, their values are quite small. In a large enough sample, tiny correlations can be significant, and this is one such case. Furthermore, the time scale of the measure is too small to predict demand two weeks out. While this measure may be of use use in sending real-time alerts to drivers, it is not useful to predict demand on a scale of two weeks.</em></p>", "interval": [], "values": [0.1922530045071852, 0.17819173414375472, 0.09014418692634624, 0.07624079334559822, 0.07830334935085183, 0.06710349821567081, 0.04819883793113789, 0.034650722269519506, 0.05379058089416783, 0.01724935793476154], "name": "hourlyDeviation", "full_name": "Hourly Deviation"}]
